pages/Page4/queries/Api2/Api2.txt

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ipor="http://www.iportalmais.pt">
   <soapenv:Header/>
   <soapenv:Body>
      <ipor:setFolder soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
			         <session_id xsi:type="xsd:string">{{appsmith.store.sessionid}}</session_id>
			<info xsi:type="ipor:Folder">
				 <name xsi:type="xsd:string">{{Input1.text}}</name>
				 </info>
      </ipor:setFolder>
   </soapenv:Body>
</soapenv:Envelope>